In [1]:
import pandas as pd

In [2]:
df=pd.read_excel(r"C:\Users\TUSHAR\OneDrive\Desktop\test jupyter\Book193.xlsx")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,216,"Kiernan, Mr. Philip",3,male,NaN,1,0,367229,7.7500,NaN,Q,0
1,217,"Newell, Miss. Madeleine",1,female,31.0,1,0,35273,113.2750,D36,C,1
2,218,"Honkanen, Miss. Eliina",3,female,27.0,0,0,STON/O2. 3101283,7.9250,NaN,S,1
3,219,"Jacobsohn, Mr. Sidney Samuel",2,male,42.0,1,0,243847,27.0000,NaN,S,0
4,220,"Bazzani, Miss. Albina",1,female,32.0,0,0,11813,76.2917,D15,C,1

In [3]:
df=df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')
df.head()

   Pclass     Sex   Age      Fare  Survived
0       3    male   NaN    7.7500         0
1       1  female  31.0  113.2750         1
2       3  female  27.0    7.9250         1
3       2    male  42.0   27.0000         0
4       1  female  32.0   76.2917         1

In [4]:
inputs=df.drop(['Survived'],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare
0       3    male   NaN    7.750
1       1  female  31.0  113.275
2       3  female  27.0    7.925

In [5]:
dummies=pd.get_dummies(inputs.Sex,dtype=int)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       0     1
4       1     0

In [6]:
inputs=pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age      Fare  female  male
0       3    male   NaN    7.7500       0     1
1       1  female  31.0  113.2750       1     0
2       3  female  27.0    7.9250       1     0
3       2    male  42.0   27.0000       0     1
4       1  female  32.0   76.2917       1     0

In [7]:
inputs=inputs.drop(['Sex'],axis='columns')
inputs.head()

   Pclass   Age      Fare  female  male
0       3   NaN    7.7500       0     1
1       1  31.0  113.2750       1     0
2       3  27.0    7.9250       1     0
3       2  42.0   27.0000       0     1
4       1  32.0   76.2917       1     0

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [10]:
inputs.Age[:10]

0     NaN
1    31.0
2    27.0
3    42.0
4    32.0
5    30.0
6    16.0
7    27.0
8    51.0
9     NaN
Name: Age, dtype: float64

In [14]:
inputs.Age=inputs.Age.fillna(inputs.Age.mean())
inputs.Age.head()

0    29.226552
1    31.000000
2    27.000000
3    42.000000
4    32.000000
Name: Age, dtype: float64

In [18]:
target=df.Survived

In [20]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2)
len(x_train)

175

In [22]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [23]:
model.fit(x_train,y_train)
model.score(x_train,y_train)

0.8

In [30]:
model.predict_proba(x_test[:5])

array([[0.99098098, 0.00901902],
       [0.97300415, 0.02699585],
       [0.03697339, 0.96302661],
       [0.94281674, 0.05718326],
       [0.06491546, 0.93508454]])

In [28]:
from sklearn.model_selection import cross_val_score

In [29]:
cross_val_score(GaussianNB(),inputs,target,cv=5)

array([0.77272727, 0.75      , 0.90909091, 0.81818182, 0.69767442])